TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/examples/dsp/dsp_vcrc_config_poly_f28p55x.c
//###############################################################################
//! \file /dsp_vcrc_config_poly_f28p55x.c
//!
//! \brief  Demo code for the configurable polynomial and data sizes (VCRC and C)
//!
//! This example shows how to
//! -# use the VCRC supported configurable polynomial and datasizes
//
//  Group:             C2000
//  Target Family:     F28P55x
//
//#############################################################################
// 
// C2000Ware v5.03.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################


//*****************************************************************************
// includes
//*****************************************************************************
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"
#include "stdio.h"

//!
//! \addtogroup VCRC_EXAMPLES Complex Fast Fourier Transform

// @{

//*****************************************************************************
// defines
//*****************************************************************************
#define NO_OF_TESTS 22
#define NBYTES1 128
#define NWORDS1 NBYTES1/2

//*****************************************************************************
// Sizes - The following defines are used to set the polynomial size and
// data size on which the CRC is computed by the CRC engine
// Polynomial size-size of of 1 bit - indicated by programming a value of 0x0
// Polynomial size-size of of 32bits - indicated by programming a value of 0x1F
// Similarly Data size -size of 1 bit - indicated by programming a value of 0x0
// Data size - size of 8 bits is indicated by programming a value of 0x7
// These are to be set in the VCRCSIZE register - PSIZE and DSIZE fields

#define SIZE_32_BITS  31
#define SIZE_31_BITS  30
#define SIZE_30_BITS  29
#define SIZE_29_BITS  28
#define SIZE_28_BITS  27
#define SIZE_27_BITS  26
#define SIZE_26_BITS  25
#define SIZE_25_BITS  24
#define SIZE_24_BITS  23
#define SIZE_23_BITS  22
#define SIZE_22_BITS  21
#define SIZE_21_BITS  20
#define SIZE_20_BITS  19
#define SIZE_19_BITS  18
#define SIZE_18_BITS  17
#define SIZE_17_BITS  16
#define SIZE_16_BITS  15
#define SIZE_15_BITS  14
#define SIZE_14_BITS  13
#define SIZE_13_BITS  12
#define SIZE_12_BITS  11
#define SIZE_11_BITS  10
#define SIZE_10_BITS  9
#define SIZE_9_BITS   8
#define SIZE_8_BITS   7
#define SIZE_7_BITS   6
#define SIZE_6_BITS   5
#define SIZE_5_BITS   4
#define SIZE_4_BITS   3
#define SIZE_3_BITS   2
#define SIZE_2_BITS   1
#define SIZE_1_BITS   0

//*****************************************************************************
// globals
//*****************************************************************************

uint32_t TestOutput[NO_OF_TESTS];
uint32_t goldenOutput[NO_OF_TESTS];

#ifdef __cplusplus
#pragma DATA_SECTION("testInput")
#else
#pragma DATA_SECTION(testInput,"testInput")
#endif //__cplusplus
uint16_t testData[NWORDS1] = {
    0x4001, 0x8002, 0xC003, 0x0004, 0x4005, 0x8006, 0xC007, 0x0008,
    0x4009, 0x800A, 0xC00B, 0x000C, 0x400D, 0x800E, 0xC00F, 0x0010,
    0x4011, 0x8012, 0xC013, 0x0014, 0x4015, 0x8016, 0xC017, 0x0018,
    0x4019, 0x801A, 0xC01B, 0x001C, 0x401D, 0x801E, 0xC01F, 0x0020,
    0x4021, 0x8022, 0xC023, 0x0024, 0x4025, 0x8026, 0xC027, 0x0028,
    0x4029, 0x802A, 0xC02B, 0x002C, 0x402D, 0x802E, 0xC02F, 0x0030,
    0x4031, 0x8032, 0xC033, 0x0034, 0x4035, 0x8036, 0xC037, 0x0038,
    0x4039, 0x803A, 0xC03B, 0x003C, 0x403D, 0x803E, 0xC03F, 0x0040,
};

void* testInput = testData;

uint16_t pass = 0;
uint16_t fail = 0;

//*****************************************************************************
// Extern function for C compuations of CRC
//*****************************************************************************
extern void CRC_run4BitENDATTableLookupC(CRC_Handle);
extern void CRC_run4BitENDATBitTableLookupC_Generic(CRC_Handle);
extern void CRC_run16BitTableLookupC(CRC_Handle);
extern void CRC_run16BitReflectedTableLookupC(CRC_Handle);
extern void CRC_run32BitTableLookupC(CRC_Handle);
extern void CRC_run32BitReflectedTableLookupC(CRC_Handle);
extern void CRC_run17BitCANFDTableLookupC(CRC_Handle);
extern void CRC_run8BitTableLookupC(CRC_Handle);

int run_vcrc_examples(void)
{
    //******************************************************************************************************
    // Note -
    // Polynomial size - size of of 1 bit - indicated by programming a value of 0x0
    // Polynomial size - size of of 32bits - indicated by programming a value of 0x1F
    // Datasize refers to the integral unit on which the CRC is computed
    // Data size - size of 1 bit - indicated by programming a value of 0x0
    // Data size - size of 8 bits is indicated by programming a value of 0x7
    // These are to be set in the VCRCSIZE register - PSIZE and DSIZE fields and they are
    // set in the functions _CRC_runConfigPolyBytes and _CRC_runConfigPolyBits implemented in the asm file
    // vcrc_configpoly_asm.asm
    // Total size of the message on which the CRC to be computed is specified by 2 elements MsgBytes and MsgBits
    // If the size of the message is in bytes - then set the value of CRC.nMsgBytes to the size of the message
    // and call the function - CRC_runConfigPolyBytes
    // if the size of the message cannot be specified in bytes - then set the value of CRC.nMsgBits to the size
    // of the message in bits and call the function - _CRC_runConfigPolyBits

