TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/examples/dsp/dsp_vcrc_config_poly_f28p55x.c
    int index = 0;

    //******************************************************************************************************
    //EXAMPLE 1 and 2 - Byte wise 4 bit CRC computation for different Msg Sizes -> 128, 7 bytes respectively

    //*****************************************************************************************
    // FIRST EXAMPLE: 128 bytes, Parity is low byte first and CRC computation in reflected mode
    //*****************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex1_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex1_Handle->run = VCRC_Ex1_CROUTINE;
    VCRC_Ex1_Handle->run(VCRC_Ex1_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex1_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex1_Handle->run = VCRC_Ex1_CRCRUN;
    VCRC_Ex1_Handle->run(VCRC_Ex1_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex1_Handle->crcResult;

    //*************************************************************************************************
    // SECOND EXAMPLE: 7 bytes(<8, odd), Parity is low byte first and CRC computation in reflected mode
    //*************************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex2_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex2_Handle->run = VCRC_Ex2_CROUTINE;
    VCRC_Ex2_Handle->run(VCRC_Ex2_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex2_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex2_Handle->run = VCRC_Ex2_CRCRUN;
    VCRC_Ex2_Handle->run(VCRC_Ex2_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex2_Handle->crcResult;

    //****************************************************************************************************
    //Example 3 and 4 - Bit wise 4 bit CRC computation for different Msg Sizes -> 13, 51 bits respectively

    //**************************************************************************************************
    // THIRD EXAMPLE: 13 bits, Parity is low byte first and CRC computation in reflected mode
    //**************************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex3_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex3_Handle->run = VCRC_Ex3_CROUTINE;
    VCRC_Ex3_Handle->run(VCRC_Ex3_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex3_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex3_Handle->run = VCRC_Ex3_CRCRUN;
    VCRC_Ex3_Handle->run(VCRC_Ex3_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex3_Handle->crcResult;

    //*************************************************************************
    // FOURTH EXAMPLE: 51 bits, parity: low byte first
    //*************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex4_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex4_Handle->run = VCRC_Ex4_CROUTINE;
    VCRC_Ex4_Handle->run(VCRC_Ex4_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex4_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex4_Handle->run = VCRC_Ex4_CRCRUN;
    VCRC_Ex4_Handle->run(VCRC_Ex4_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex4_Handle->crcResult;

    //***************************************************************************************
    //Example 5 and 6 - Byte wise 16 bit CRC computation for Msg Sizes - 8, 128 bytes of data

    //***************************************************************************************
    // FIFTH EXAMPLE: 8 Bytes, Parity is low byte first and CRC computation in reflected mode
    //***************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex5_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex1_Handle->run = VCRC_Ex5_CROUTINE;
    VCRC_Ex5_Handle->run(VCRC_Ex5_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex5_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex5_Handle->run = VCRC_Ex5_CRCRUN;
    VCRC_Ex5_Handle->run(VCRC_Ex5_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex5_Handle->crcResult;

    //*********************************************************************************************
    // SIXTH EXAMPLE: 128 bytes, Parity is low byte first and CRC computation in non-reflected mode
    //*********************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex6_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex6_Handle->run = VCRC_Ex6_CROUTINE;
    VCRC_Ex6_Handle->run(VCRC_Ex6_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex6_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex6_Handle->run = VCRC_Ex6_CRCRUN;
    VCRC_Ex6_Handle->run(VCRC_Ex6_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex6_Handle->crcResult;

    //******************************************************************************************
    // Example 7 and 8 - Bit wise 16 bit CRC computation for Msg Sizes - 48, 128 bits of data

    //******************************************************************************************************
    // SEVENTH EXAMPLE: 48 bits(i.e 6 bytes), Parity is low byte first and CRC computation in reflected mode
    //******************************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex7_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex7_Handle->run = VCRC_Ex7_CROUTINE;
    VCRC_Ex7_Handle->run(VCRC_Ex7_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex7_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex7_Handle->run = VCRC_Ex7_CRCRUN;
    VCRC_Ex7_Handle->run(VCRC_Ex7_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex7_Handle->crcResult;

    //********************************************************************************************
    // EIGHTH EXAMPLE: 128 bits, Parity is low byte first and CRC computation in non-reflected mode
    //********************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex8_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex8_Handle->run = VCRC_Ex8_CROUTINE;
    VCRC_Ex8_Handle->run(VCRC_Ex8_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex8_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex8_Handle->run = VCRC_Ex8_CRCRUN;
    VCRC_Ex8_Handle->run(VCRC_Ex8_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex8_Handle->crcResult;

    //***************************************************************************************************
    // Example 9 and 10 - Byte wise 16 bit CRC computation for different Msg Sizes - 10, 15 bytes of data
    //***************************************************************************************************
    // NINETH EXAMPLE: 10 bytes, Parity is high byte first and CRC computation in reflected mode
    //******************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex9_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex9_Handle->run = VCRC_Ex9_CROUTINE;
    VCRC_Ex9_Handle->run(VCRC_Ex9_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex9_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex9_Handle->run = VCRC_Ex9_CRCRUN;
    VCRC_Ex9_Handle->run(VCRC_Ex9_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex9_Handle->crcResult;

    //*********************************************************************************************
    // TENTH EXAMPLE: 15 bytes, Parity is high byte first and CRC computation in non-reflected mode
    //*********************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex10_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex10_Handle->run = VCRC_Ex10_CROUTINE;
    VCRC_Ex10_Handle->run(VCRC_Ex10_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex10_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex10_Handle->run = VCRC_Ex10_CRCRUN;
    VCRC_Ex10_Handle->run(VCRC_Ex10_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex10_Handle->crcResult;

    //*************************************************************************************
    // Example 11 and 12 - Bit wise 16 bit CRC computation for Msg Sizes - 6 bytes of data

