TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/examples/dsp/dsp_vcrc_config_poly_f28p55x.c
    //*******************************************************************************************
    // ELEVENTH EXAMPLE: 48 bits, Parity is high byte first and CRC computation in reflected mode
    //*******************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex11_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex11_Handle->run = VCRC_Ex11_CROUTINE;
    VCRC_Ex11_Handle->run(VCRC_Ex11_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex11_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex11_Handle->run = VCRC_Ex11_CRCRUN;
    VCRC_Ex11_Handle->run(VCRC_Ex11_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex11_Handle->crcResult;

    //***********************************************************************************************
    // TWELVETH EXAMPLE: 48 bits, Parity is high byte first and CRC computation in non-reflected mode
    //***********************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex12_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex12_Handle->run = VCRC_Ex12_CROUTINE;
    VCRC_Ex12_Handle->run(VCRC_Ex12_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex12_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex12_Handle->run = VCRC_Ex12_CRCRUN;
    VCRC_Ex12_Handle->run(VCRC_Ex12_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex12_Handle->crcResult;

    //***************************************************************************************************************
    // Example 13 and 14 - Bit wise 16 bit CRC computation for MODBUS protocol with P2 polynomial for 48 bits of data

    //************************************************************************************************
    // THIRTEENTH EXAMPLE: 48 bits, Parity is low byte first and CRC computation in non-reflected mode
    //************************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex13_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex13_Handle->run = VCRC_Ex13_CROUTINE;
    VCRC_Ex13_Handle->run(VCRC_Ex13_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex13_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex13_Handle->run = VCRC_Ex13_CRCRUN;
    VCRC_Ex13_Handle->run(VCRC_Ex13_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex13_Handle->crcResult;

    //*********************************************************************************************
    // FOURTEENTH EXAMPLE : 48 bits, Parity is low byte first and CRC computation in reflected mode
    //*********************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex14_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex14_Handle->run = VCRC_Ex14_CROUTINE;
    VCRC_Ex14_Handle->run(VCRC_Ex14_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex14_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex14_Handle->run = VCRC_Ex14_CRCRUN;
    VCRC_Ex14_Handle->run(VCRC_Ex14_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex14_Handle->crcResult;

    //***************************************************************************************************
    // Example 15 and 16 - Byte wise 32 bit CRC computation for P1 polynomial for Msg Sizes - 16, 6 bytes

    //************************************************************************************************
    // FIFTEENTH EXAMPLE: 16 bytes, Parity is low byte first and CRC computation in non reflected mode
    //************************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex15_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex15_Handle->run = VCRC_Ex15_CROUTINE;
    VCRC_Ex15_Handle->run(VCRC_Ex15_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex15_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex15_Handle->run = VCRC_Ex15_CRCRUN;
    VCRC_Ex15_Handle->run(VCRC_Ex15_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex15_Handle->crcResult;

    //*******************************************************************************************
    // SIXTEENTH EXAMPLE: 6 bytes, Parity is low byte first and CRC computation in reflected mode
    //*******************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex16_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex16_Handle->run = VCRC_Ex16_CROUTINE;
    VCRC_Ex16_Handle->run(VCRC_Ex16_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex16_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex16_Handle->run = VCRC_Ex16_CRCRUN;
    VCRC_Ex16_Handle->run(VCRC_Ex16_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex16_Handle->crcResult;

    //***************************************************************************************************
    // Example 17 and 18 - Bit wise 32 bit CRC computation for P1 polynomial for Msg Sizes - 48, 128 bits

    //*************************************************************************************************
    // SEVENTEENTH EXAMPLE: 48 bits, Parity is low byte first and CRC computation in non reflected mode
    //*************************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex17_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex17_Handle->run = VCRC_Ex17_CROUTINE;
    VCRC_Ex17_Handle->run(VCRC_Ex17_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex17_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex17_Handle->run = VCRC_Ex17_CRCRUN;
    VCRC_Ex17_Handle->run(VCRC_Ex17_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex17_Handle->crcResult;

    //*********************************************************************************************
    // EIGHTEENTH EXAMPLE: 128 bits, Parity is low byte first and CRC computation in reflected mode
    //*********************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex18_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex18_Handle->run = VCRC_Ex18_CROUTINE;
    VCRC_Ex18_Handle->run(VCRC_Ex18_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex18_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex18_Handle->run = VCRC_Ex18_CRCRUN;
    VCRC_Ex18_Handle->run(VCRC_Ex18_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex18_Handle->crcResult;

    //*********************************************************************************************
    // Example 19 and 20 - Byte wise 17 bit CRC computation for Msg Size - 16 bytes
    //*********************************************************************************************
    // NINETEENTH EXAMPLE: 128 bits, Parity is low byte first and CRC computation in reflected mode
    //*********************************************************************************************

    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex19_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex19_Handle->run = VCRC_Ex19_CROUTINE;
    VCRC_Ex19_Handle->run(VCRC_Ex19_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex19_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex19_Handle->run = VCRC_Ex19_CRCRUN;
    VCRC_Ex19_Handle->run(VCRC_Ex19_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex19_Handle->crcResult;

