TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/examples/dsp/dsp_vcrc_config_poly_f28p55x.c
    //******************************************************************************************
    // Bit wise 17 bit CRC computation for Msg Size - 128 bits
    //*******************************************************************************************
    // TWENTYTH EXAMPLE: 128 bits, Parity is low byte first and CRC computation in reflected mode
    //*******************************************************************************************
    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex20_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex20_Handle->run = VCRC_Ex20_CROUTINE;
    VCRC_Ex20_Handle->run(VCRC_Ex20_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex20_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex20_Handle->run = VCRC_Ex20_CRCRUN;
    VCRC_Ex20_Handle->run(VCRC_Ex20_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex20_Handle->crcResult;

    //*************************************************************************
    // Example 21 and 2 - Bit wise 8 bit CRC computation for Msg Size - 32 bits
    //*************************************************************************

    // TWENTYONETH EXAMPLE: 32 bits, Parity is low byte first and CRC computation in reflected mode
    //*********************************************************************************************
    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex21_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex21_Handle->run = VCRC_Ex21_CROUTINE;
    VCRC_Ex21_Handle->run(VCRC_Ex21_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex21_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex21_Handle->run = VCRC_Ex21_CRCRUN;
    VCRC_Ex21_Handle->run(VCRC_Ex21_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex21_Handle->crcResult;

    //*****************************************************
    // Byte wise 8 bit CRC computation for Msg Size 56 bits

    //*********************************************************************************************
    // TWENTYTWOTH EXAMPLE: 32 bits, Parity is low byte first and CRC computation in reflected mode
    //*********************************************************************************************
    // Initialize CRC objects
    extern CRC_Handle VCRC_Ex22_Handle; // Declared and intialized in syscfg

    // Step 1: Calculate the golden value using the C routine
    VCRC_Ex22_Handle->run = VCRC_Ex22_CROUTINE;
    VCRC_Ex22_Handle->run(VCRC_Ex22_Handle);
    goldenOutput[index] = (uint16_t)VCRC_Ex22_Handle->crcResult;

    // Step 2: run the CRC module with the VCRC assembly code
    VCRC_Ex22_Handle->run = VCRC_Ex22_CRCRUN;
    VCRC_Ex22_Handle->run(VCRC_Ex22_Handle);
    TestOutput[index++] = (uint16_t)VCRC_Ex22_Handle->crcResult;

    for(index = 0; index < NO_OF_TESTS; index ++){
       if(TestOutput[index] == goldenOutput[index]){
           pass++;
       }else{
           fail++;
       }
    }

    printf("Total of %d tests pass, and %d failure",pass,fail);

    return 1;
}

//
// Main
//
void main(void)
{
    //
    // Initialize device clock and peripherals
    //
    Device_init();

    //
    // Disable pin locks and enable internal pull-ups.
    //
    Device_initGPIO();

    //
    // Initialize PIE and clear PIE registers. Disables CPU interrupts.
    //
    Interrupt_initModule();

    //
    // Initialize the PIE vector table with pointers to the shell Interrupt
    // Service Routines (ISR).
    //
    Interrupt_initVectorTable();

    //
    // PinMux and Peripheral Initialization
    //
    Board_init();

    //
    // C2000Ware Library initialization
    //
    C2000Ware_libraries_init();

    //
    // Enable Global Interrupt (INTM) and real time interrupt (DBGM)
    //
    EINT;
    ERTM;

    run_vcrc_examples();

    while(1)
    {

    }
}

// End of main

// @} //addtogroup

// End of file
